<template>
  <div class="modalOverlay">
    <div class="modalWrapper">
      <div class="modal">

        <div class="modalHeading">
          <!--      <img class="check" src="~/assets/check-icon.png" alt=""/>-->
          <div class="modalClose" @click="$emit('modalClose')">
            <svg width="20" height="21" viewBox="0 0 20 21" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                d="M10 0.937988L10.324 0.938988L10.642 0.942988L11.258 0.959988L11.557 0.972988L12.136 1.00699L12.689 1.05299C17.474 1.51699 19.421 3.46399 19.885 8.24899L19.931 8.80199L19.965 9.38099C19.97 9.47899 19.975 9.57899 19.978 9.67999L19.995 10.296L20 10.938L19.995 11.58L19.978 12.196L19.965 12.495L19.931 13.074L19.885 13.627C19.421 18.412 17.474 20.359 12.689 20.823L12.136 20.869L11.557 20.903C11.459 20.908 11.359 20.913 11.258 20.916L10.642 20.933L10 20.938L9.358 20.933L8.742 20.916L8.443 20.903L7.864 20.869L7.311 20.823C2.526 20.359 0.579 18.412 0.115 13.627L0.069 13.074L0.0350001 12.495C0.0301352 12.3953 0.0258018 12.2957 0.0220001 12.196L0.00500011 11.58C0.00200011 11.37 0 11.156 0 10.938L0.000999928 10.614L0.00500011 10.296L0.0220001 9.67999L0.0350001 9.38099L0.069 8.80199L0.115 8.24899C0.579 3.46399 2.526 1.51699 7.311 1.05299L7.864 1.00699L8.443 0.972988C8.541 0.967988 8.641 0.962988 8.742 0.959988L9.358 0.942988C9.568 0.939988 9.782 0.937988 10 0.937988ZM8.511 8.07799C8.30148 7.95327 8.05361 7.90939 7.81401 7.95462C7.57441 7.99984 7.35959 8.13105 7.20995 8.32357C7.06031 8.51608 6.98617 8.75664 7.00146 8.99999C7.01675 9.24334 7.12043 9.47272 7.293 9.64499L8.585 10.938L7.293 12.231L7.21 12.325C7.05459 12.526 6.98151 12.7786 7.0056 13.0315C7.02969 13.2844 7.14916 13.5187 7.33972 13.6867C7.53029 13.8548 7.77767 13.944 8.03162 13.9362C8.28557 13.9285 8.52704 13.8243 8.707 13.645L10 12.353L11.293 13.645L11.387 13.728C11.588 13.8834 11.8406 13.9565 12.0935 13.9324C12.3464 13.9083 12.5807 13.7888 12.7488 13.5983C12.9168 13.4077 13.006 13.1603 12.9982 12.9064C12.9905 12.6524 12.8863 12.4109 12.707 12.231L11.415 10.938L12.707 9.64499L12.79 9.55099C12.9454 9.35 13.0185 9.09739 12.9944 8.84446C12.9703 8.59154 12.8508 8.35727 12.6603 8.18924C12.4697 8.0212 12.2223 7.93201 11.9684 7.93976C11.7144 7.94752 11.473 8.05164 11.293 8.23099L10 9.52299L8.707 8.23099L8.613 8.14799L8.511 8.07799Z"
                fill="#4D4C4C"/>
            </svg>
            <!--      <img class="close-img" src="~/assets/close-icon.svg" alt=""/>-->
          </div>
        </div>

        <div class="modalBody">
          <slot name="modalBody">

            <div class="modalBodyText">
              <div class="modalBodyTextParagraph">
                <h3>Тип товара - Товар 1</h3>
                <p>
                  Холодильники, посудомоечные машины, стиральные машины, распределительные электрические вентиляторы,
                  распределительные машины для изменения температуры воздуха, распределительные устройства
                  кондиционирования
                  воздуха, нерегулируемые кондиционеры с раздельным управлением, бытовые электронные весы, пылесосы,
                  электрические бритвы, электрические утюги, микроволновые печи, другие электрические нагревательные
                  приборы, фены, рулонные палочки, питьевые машины,моющие телефоны, маршрутизаторы, принтеры, усилители
                  WiFi, электрические зубные щетки, зубные щетки, линии передачи данных, Зарядная головка, лампа,
                  игровая
                  рукоятка, игровой автомат, зарядка автомобиля, приставка, сушилка для овощей, электрическая точилка,
                  морозильник Обрезчик волосяных шариков
                </p>
              </div>
              <div class="modalBodyTextParagraph">
                <h3>Тип товара - Товар 2</h3>
                <p>
                  Ручной инструмент (без подзарядки), автомобильные шины, автомобильные компакт - диски, чемоданы
                  деталей, чемоданы, крышки и плащи автомобиля, сотовые аксессуары, сумки, шапки, косметика, сотовые
                  аксессуары, мобильные источники питания, литр металлические бомбы, оборудование машинные доски,
                  двигатель, жидкостный насос, электродвигатель, генератор, аккумулятор, электрическое оборудование для
                  выключателей или защитных цепей, белые тканевые лампы, разрядные лампы, электрические, электрические
                  Участки с двигателями, кузов, запасные части и аксессуары для автотранспортных средств, детали для
                  специальных автомобилей и полуприцепов, запасные части для сельскохозяйственной садоводческой и
                  лесозаготовительной техники, детали для машин для уборки или гранулирования сельскохозяйственных
                  культур или механические шариковые или роликовые подшипники, приводные валы (включая кулачки и
                  кривошипы), подшипники и подшипники для подшипников вала, шестерни, шариковые винты, коробки передач,
                  трансмиссия, трансмиссия, трансмиссия, сцепления и устройства для соединительных валов для маховиков,
                  фарфор, Стеклянная посуда, гвоздь, гвоздь, гайка, гайка, головка лопаты, вилка
                </p>
              </div>

              <div class="modalBodyTextParagraph">
                <h3>Тип товара - Товар 3</h3>
                <p>
                  Керамическая посуда, стеклянная посуда, металлическая посуда, велосипед, туалет, раковина, кухонный
                  инвентарь, посуда (доска, нож, сито, ложка, вилка, кухонная посуда, мешалка, лопата и т.д.)
                  Лампы, светодиоды, светодиодные ленты, люстры, светильники, прожекторы и пятнистые лампы, светодиодные
                  знаки и аксессуары, отвертки, напильники, болты, самонарезанные винты
                  скатерть, холст, пленка, шотландская лента, строительная лента, моль лента, вешалка, манекен, плечи,
                  рама, (фото, живопись,), детское кресло, кресло, дверной замок, дверные ручки, дверные аксессуары,
                  детская тележка, герметик, клей, карбонгидрат, установка пены, обои, мешки, ручной зонт, оборудование
                  для общественного питания, промышленная ткань
                  Тележки, мебель
                  Канцелярские принадлежности
                </p>
              </div>

              <div class="modalBodyTextParagraph">
                <a href="#">Прочая информация о сроке-доставки, плотности груза и категорий товаров смотрите на этой
                  странице!</a>
              </div>
            </div>

          </slot>
        </div>

      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "FormDataDemandsModal",
  mounted() {
    //hide body scroll
    document.body.style.overflow = 'hidden';
  },
  // close
  destroyed() {
    document.body.style.overflow = 'auto';
  },
  beforeDestroy() {
    document.body.style.overflow = 'auto';
  }
}
</script>

<style scoped>

.modalOverlay {
  position: fixed;
  top: 0;
  bottom: 0;
  left: 0;
  right: 0;
  display: flex;
  justify-content: center;
  background-color: #000000da;
  z-index: 100;
}

.modalWrapper {
  display: flex;
  align-items: center;
  justify-content: center;
  box-sizing: border-box;
  height: 100vh;
  width: 100vw;
}

.modal {
  position: relative;
  text-align: center;
  background-color: white;
  height: 50vh;
  width: 64vh;
  padding: 60px 0;
  border-radius: 20px;
  margin: 10vh 1vh;
  overflow: hidden;
}

.modalClose {
  cursor: pointer;
  position: absolute;
  top: 2vh;
  bottom: 0;
  right: 2vh;
}

.modalClose > svg {
  max-width: 24px;
}

.modalBody {
  padding: 0 2vh;
}

.modalBodyText {
  overflow-y: scroll;
  overflow-x: hidden;
  height: 39vh;
  text-align: left;
}

.modalBodyTextParagraph {
  margin-bottom: 24px;
}

.modalBodyTextParagraph h3 {
  margin-bottom: 8px;
  font-size: 16px;
  font-style: normal;
  font-weight: 500;
  line-height: normal;
}

.modalBodyTextParagraph p {
  margin-bottom: 8px;
  font-size: 12px;
  font-style: normal;
  font-weight: 400;
  line-height: 180%; /* 154.545% */
}

.modalBodyTextParagraph a {
  color: var(--bg-connect-color);
  font-size: 13px;
  text-decoration-line: underline;
  font-weight: 500;
  line-height: 160%; /* 154.545% */
}
</style>
